In [ ]:
x = 1

In [ ]:
x

In [ ]:
type(x)

In [ ]:
y = 1.8

In [ ]:
y

In [ ]:
type(y)

In [ ]:
z = True

In [ ]:
type(z)

In [ ]:
x = 1
str(x)

In [ ]:
type(x)

In [ ]:
x = str(x)
type(x)

In [ ]:
x = '1'
int(x)
type(x)

In [ ]:
x = int(x)
type(x)

In [ ]:
x = None
x
type(x)
# null 값

In [ ]:
list1 = []
list1 = list() # 함수로 만드는 것이라서 ()

In [ ]:
list1.insert(0, 'A')
list1.append('B')
list1

In [ ]:
list2 = [i for i in range(10)]

In [ ]:
list2

In [ ]:
list2[4]

In [ ]:
list2[-1]

In [ ]:
list2[1:5]

In [ ]:
list2[-4: -1] # 끝에거는 안 가져옴

In [ ]:
list2[:-1]

In [ ]:
list2[1:]

In [ ]:
x = (1, 2, 3, 4)

In [ ]:
dict1 = {}
dict2 = dict()

In [ ]:
dict1 = {'name' : 'wonkyung'}

In [ ]:
dict1['age'] = 20

In [ ]:
dict1

In [ ]:
if False:
    print('Hello')
    
print('World')

In [ ]:
for 변수 in 반복될 대상:
    구문

In [ ]:
range(0,10)

In [ ]:
list(range(0,10))

In [ ]:
for i in range(10):
    for j in range(10):
        print('i:', i, 'j:', j)

In [ ]:
def 함수(매개변수):
    구문 1 
    return

매개 없고 리턴 없는 함수
매개 있고 리턴 없는 함수
매개 없고 리턴 있는 함수 
매개 있고 리턴 있는 함수

In [ ]:
*args **kwargs(사용자가 매개변수 이름 뭐라 지을지 모를때)

print(*args, sep=' '. end='\n')

In [1]:
print('문자열', sep=' ', end='\n')

문자열

In [3]:
print('Hello', 'World')

Hello World

In [2]:
print('Hello', 'World', sep='|')

Hello|World

In [4]:
print('Hello', 'World', end='')
print('Hello', 'Python')

Hello WorldHello Python

print('{0},{1}'.format(value1, value2))

In [6]:
print('This is {}. That is {}'.format('apple','banana'))

This is apple. That is banana

In [7]:
print('This is {1}. That is {0}'.format('apple','banana'))

This is banana. That is apple

In [8]:
a = 'apple'
b = 'banana'

print('This is {}. That is {}'.format(a,b))

This is apple. That is banana

In [9]:
print('This is {fruit1}. That is {fruit2}'.format(fruit1='apple', fruit2='banana'))

This is apple. That is banana

In [10]:
print('This is {0:0.3f}'.format(123.45678))

This is 123.457

0.3f : 세자리까지 출력해라 (반올림도 함)

In [12]:
print('This is {0:0.10f}'.format(123.45678)) # 남는 건 영으로 채움

This is 123.4567800000

In [14]:
print('This is {:03d}'.format(12))

This is 012

f 는 실수 d 는 정수

In [15]:
print('This is {:03d}'.format(1234))

This is 1234

### 포맷팅

- %s 문자열
- %d 정수
- %f 실수

- %o 8진수
- %x 16진수

In [17]:
print(f'This is %s'%'apple')

This is apple

In [18]:
print(f'This is %s. That is %s.'%('apple','banana'))

This is apple. That is banana.

In [19]:
print(f'The value is %d'% 1)

The value is 1

In [20]:
print(f'The value is %5d' % 1) #다섯자리로 만들어라

The value is     1

In [22]:
print(f'The value is %05d' % 1)

The value is 00001

In [29]:
for i in range(2,10):
    for j in range(1,10):
        print(f'%d * %d = %2d' %(i,j,i*j))

2 * 1 =  2
2 * 2 =  4
2 * 3 =  6
2 * 4 =  8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
3 * 1 =  3
3 * 2 =  6
3 * 3 =  9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27
4 * 1 =  4
4 * 2 =  8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36
5 * 1 =  5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45
6 * 1 =  6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54
7 * 1 =  7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63
8 * 1 =  8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72
9 * 1 =  9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81

In [34]:
print(f'The Value is %.3f'%123.456789)

The Value is 123.457

In [ ]:
2 진수 : 0 1 10 11 100 101 110 111
10 진수: 0 1 2  3  4   5   6   7

In [ ]:
8 진수 : 0 1 2 3 4 5 6 7 10 11 12 13 14 15 16 17 20

In [ ]:
10 진수: 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18
16 진수: 0 1 2 3 4 5 6 7 8 9 a  b  c  d  e  f  10 11

In [38]:
for i in range(10) :
    print(f'The value is %o'%i)

The value is 0
The value is 1
The value is 2
The value is 3
The value is 4
The value is 5
The value is 6
The value is 7
The value is 10
The value is 11

In [39]:
for i in range(18) :
    print(f'The value is %x'%i)

The value is 0
The value is 1
The value is 2
The value is 3
The value is 4
The value is 5
The value is 6
The value is 7
The value is 8
The value is 9
The value is a
The value is b
The value is c
The value is d
The value is e
The value is f
The value is 10
The value is 11

# Dataframe

In [40]:
import pandas as pd

- dataframe :  시리즈 + 시리즈 + 시리즈... 시리즈들이 여러 개 붙어있는 것이 데이터 프레임이다.

In [42]:
df = pd.DataFrame( {'name' : ['yejin', 'jiwon', 'sangheon'],
                    'age' : ['25', '22', '32'],
                    'gender' : ['F', 'F', 'M']} )

In [43]:
df

       name age gender
0     yejin  25      F
1     jiwon  22      F
2  sangheon  32      M

In [44]:
df['name']

0       yejin
1       jiwon
2    sangheon
Name: name, dtype: object

In [45]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [47]:
df.head(1)

    name age gender
0  yejin  25      F

In [48]:
df.tail(1)

       name age gender
2  sangheon  32      M

In [49]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [50]:
df['age'].astype(int)

0    25
1    22
2    32
Name: age, dtype: int32

In [52]:
df['age'] = df['age'].astype(int)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int32
 2   gender  3 non-null      object
dtypes: int32(1), object(2)
memory usage: 188.0+ bytes

In [54]:
df['age'].sum()

79

In [55]:
df['age'].mean()

26.333333333333332

In [56]:
df['age'].median()

25.0

In [57]:
print(df['age'].sum()) #합
print(df['age'].mean())
print(df['age'].median())
print(df['age'].max())
print(df['age'].min())
print(df['age'].var())
print(df['age'].std())

79
26.333333333333332
25.0
32
22
26.333333333333332
5.131601439446884

In [58]:
df.describe() #object를 제외한 나머지를 이렇게 계산해줌

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [65]:
df[(df['age'] > 25)]

       name  age gender
2  sangheon   32      M

In [66]:
# loc, iloc

In [68]:
df = pd.DataFrame( {'name' : ['yejin', 'jiwon', 'sangheon'],
                    'age' : ['25', '22', '32'],
                    'gender' : ['1', '1', '0']},
                  index = ['a','b','c']
                 )

In [69]:
df.loc['a']

name      yejin
age          25
gender        1
Name: a, dtype: object

In [70]:
df.iloc[0]

name      yejin
age          25
gender        1
Name: a, dtype: object

In [71]:
df.loc['a']['name']

'yejin'

In [72]:
df.iloc[0]['name']

'yejin'

In [73]:
df.iloc[0].age

'25'

In [74]:
df.iloc[0].name # index를 가져오게 되어있음

'a'

In [75]:
df.iloc

In [76]:
df1 = pd.DataFrame({'A': [1,2,3,4],
                   'B': [5,6,7,8],
                   'C': [9,10,11,12]})
df2 = pd.DataFrame({'A': [13,14,15,16],
                    'B': [17,18,19,20],
                    'C': [21,22,23,24]})

In [77]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [78]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [79]:
df3 = pd.concat([df1, df2])

In [81]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [82]:
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [83]:
df3.reset_index(drop=True)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [84]:
df3 = df3.reset_index(drop=True)

In [85]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [87]:
pd.concat([df1,df2], axis = 0)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [86]:
pd.concat([df1,df2], axis = 1)

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [88]:
df1['D'] = [13,14,15,16]

In [89]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [92]:
df1.drop('A',axis = 1)

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [93]:
df1.drop('A', axis = 1, inplace=True)

In [94]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

# Groupby

In [112]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
        'Sales' : [200, 120, 340, 124,243, 350]
       }

In [96]:
df = pd.DataFrame(data)

In [118]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [119]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [100]:
# 회사별 세일즈 값의 평균

In [122]:
df['Company'] == 'GOOG'

0     True
1     True
2    False
3    False
4    False
5    False
Name: Company, dtype: bool

In [125]:
df[df['Company'] == 'GOOG']['Sales'].mean()

160.0

In [126]:
df[df['Company'] == 'MSFT']['Sales'].mean()

232.0

In [127]:
df[df['Company'] == 'FB']['Sales'].mean()

296.5

In [128]:
print(df[df['Company'] == 'GOOG']['Sales'].mean())
print(df[df['Company'] == 'MSFT']['Sales'].mean())
print(df[df['Company'] == 'FB']['Sales'].mean())

160.0
232.0
296.5

In [129]:
for com in df['Company'].unique():
    print(com)

GOOG
MSFT
FB

In [130]:
for com in df['Company'].unique():
    print(com, df[df['Company'] == com]['Sales'].mean())

GOOG 160.0
MSFT 232.0
FB 296.5

In [131]:
df.groupby('Company')

In [132]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [133]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [134]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [139]:
df.groupby('Company').mean() # 그룹바이 - 출력시 잘 안 보임

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [136]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [137]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [138]:
df.groupby('Company').max()

           Person  Sales
Company
FB          Sarah    350
GOOG          Sam    200
MSFT     Veanessa    340

In [140]:
df.groupby(['Company', 'Person']).mean()

                  Sales
Company Person
FB      Carl      243.0
        Sarah     350.0
GOOG    Charlie   120.0
        Sam       200.0
MSFT    Amy       340.0
        Veanessa  124.0

In [141]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [142]:
df.groupby('Company')['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [152]:
df = pd.DataFrame({'수학점수':[65,80,60,80],
                   '과학점수':[50,75,60,80],
                   '내신등급':[3,1,2,1]})

In [153]:
df

   수학점수  과학점수  내신등급
0    65    50     3
1    80    75     1
2    60    60     2
3    80    80     1

In [154]:
df.sort_values(by='수학점수')

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [155]:
df.sort_values('수학점수')

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [156]:
df.sort_values(by='수학점수', ascending = False)

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [158]:
df.sort_values(by=['수학점수','과학점수'],  ascending = [True, False])

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
3    80    80     1
1    80    75     1